-- MySQL dump 10.13  Distrib 8.3.0, for macos14.2 (arm64)
--
-- Host: localhost    Database: nursing-home
-- ------------------------------------------------------
-- Server version	5.7.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `clinic_hours`
--

DROP TABLE IF EXISTS `clinic_hours`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `clinic_hours` (
  `clinic_hours_id` bigint(20) NOT NULL,
  `created_at` datetime(6) DEFAULT NULL,
  `hospital_id` bigint(20) DEFAULT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  `break_time` varchar(255) DEFAULT NULL,
  `deadline_time` varchar(255) DEFAULT NULL,
  `week_name` varchar(255) DEFAULT NULL,
  `week_time` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`clinic_hours_id`),
  KEY `FK1brbpyo35p1g3nk5hg9yu55ma` (`hospital_id`),
  CONSTRAINT `FK1brbpyo35p1g3nk5hg9yu55ma` FOREIGN KEY (`hospital_id`) REFERENCES `hospital` (`hospital_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `clinic_hours`
--

LOCK TABLES `clinic_hours` WRITE;
/*!40000 ALTER TABLE `clinic_hours` DISABLE KEYS */;
INSERT INTO `clinic_hours` VALUES (1,'2024-05-03 16:31:12.382016',1,'2024-05-03 16:31:12.382030',NULL,NULL,'목','09:00 - 18:00'),(2,'2024-05-03 16:31:12.387693',1,'2024-05-03 16:31:12.387707',NULL,NULL,'금','09:00 - 18:00'),(3,'2024-05-03 16:31:12.389913',1,'2024-05-03 16:31:12.389925',NULL,NULL,'토','09:00 - 12:30'),(4,'2024-05-03 16:31:12.394905',1,'2024-05-03 16:31:12.394916',NULL,NULL,'일','정기휴무 (매주 일요일)'),(5,'2024-05-03 16:31:12.396636',1,'2024-05-03 16:31:12.396647',NULL,NULL,'월','09:00 - 18:00'),(6,'2024-05-03 16:31:12.398789',1,'2024-05-03 16:31:12.398805',NULL,NULL,'화','09:00 - 18:00'),(7,'2024-05-03 16:31:12.401190',1,'2024-05-03 16:31:12.401203',NULL,NULL,'수','09:00 - 18:00'),(8,'2024-05-03 16:31:12.432720',2,'2024-05-03 16:31:12.432735','13:00 - 14:00',NULL,'목','09:00 - 18:00'),(9,'2024-05-03 16:31:12.440551',2,'2024-05-03 16:31:12.440563','13:00 - 14:00',NULL,'금','09:00 - 18:00'),(10,'2024-05-03 16:31:12.442927',2,'2024-05-03 16:31:12.442938','13:00 - 14:00',NULL,'토','10:00 - 16:00'),(11,'2024-05-03 16:31:12.444978',2,'2024-05-03 16:31:12.444989','13:00 - 14:00',NULL,'일','10:00 - 16:00'),(12,'2024-05-03 16:31:12.446920',2,'2024-05-03 16:31:12.446930','13:00 - 14:00',NULL,'월','09:00 - 18:00'),(13,'2024-05-03 16:31:12.448954',2,'2024-05-03 16:31:12.448970','13:00 - 14:00',NULL,'화','09:00 - 18:00'),(14,'2024-05-03 16:31:12.451704',2,'2024-05-03 16:31:12.451713','13:00 - 14:00',NULL,'수','09:00 - 18:00'),(15,'2024-05-03 16:31:12.464882',3,'2024-05-03 16:31:12.464897',NULL,NULL,'목','09:00 - 18:00'),(16,'2024-05-03 16:31:12.467525',3,'2024-05-03 16:31:12.467532',NULL,NULL,'금','09:00 - 18:00'),(17,'2024-05-03 16:31:12.469540',3,'2024-05-03 16:31:12.469547',NULL,NULL,'토','09:00 - 13:00'),(18,'2024-05-03 16:31:12.471217',3,'2024-05-03 16:31:12.471227',NULL,NULL,'일','정기휴무 (매주 일요일)'),(19,'2024-05-03 16:31:12.472990',3,'2024-05-03 16:31:12.472996',NULL,NULL,'월','09:00 - 18:00'),(20,'2024-05-03 16:31:12.474861',3,'2024-05-03 16:31:12.474868',NULL,NULL,'화','09:00 - 18:00'),(21,'2024-05-03 16:31:12.476589',3,'2024-05-03 16:31:12.476596',NULL,NULL,'수','09:00 - 18:00'),(22,'2024-05-03 16:31:12.490158',4,'2024-05-03 16:31:12.490167','13:00 - 14:00',NULL,'목','09:30 - 18:30'),(23,'2024-05-03 16:31:12.491925',4,'2024-05-03 16:31:12.491932','13:00 - 14:00',NULL,'금','09:30 - 18:30'),(24,'2024-05-03 16:31:12.493786',4,'2024-05-03 16:31:12.493793',NULL,NULL,'토','정기휴무 (매주 토요일)'),(25,'2024-05-03 16:31:12.496305',4,'2024-05-03 16:31:12.496328',NULL,NULL,'일','정기휴무 (매주 일요일)'),(26,'2024-05-03 16:31:12.499654',4,'2024-05-03 16:31:12.499669','13:00 - 14:00',NULL,'월','09:30 - 18:30'),(27,'2024-05-03 16:31:12.503033',4,'2024-05-03 16:31:12.503049','13:00 - 14:00',NULL,'화','09:30 - 18:30'),(28,'2024-05-03 16:31:12.504623',4,'2024-05-03 16:31:12.504630','13:00 - 14:00',NULL,'수','09:30 - 18:30'),(29,'2024-05-03 16:31:12.518776',5,'2024-05-03 16:31:12.518784','12:00 - 13:00',NULL,'목','09:00 - 18:00'),(30,'2024-05-03 16:31:12.520353',5,'2024-05-03 16:31:12.520360','12:00 - 13:00',NULL,'금','09:00 - 18:00'),(31,'2024-05-03 16:31:12.522341',5,'2024-05-03 16:31:12.522364','12:00 - 13:00',NULL,'토','10:00 - 17:00'),(32,'2024-05-03 16:31:12.524968',5,'2024-05-03 16:31:12.524975',NULL,NULL,'일','정기휴무 (매주 일요일)'),(33,'2024-05-03 16:31:12.527115',5,'2024-05-03 16:31:12.527127','12:00 - 13:00',NULL,'월','09:00 - 18:00'),(34,'2024-05-03 16:31:12.529109',5,'2024-05-03 16:31:12.529115','12:00 - 13:00',NULL,'화','09:00 - 18:00'),(35,'2024-05-03 16:31:12.531360',5,'2024-05-03 16:31:12.531385','12:00 - 13:00',NULL,'수','09:00 - 18:00'),(36,'2024-05-03 16:31:12.550905',6,'2024-05-03 16:31:12.550913','12:30 - 13:30',NULL,'목','09:00 - 18:00'),(37,'2024-05-03 16:31:12.552497',6,'2024-05-03 16:31:12.552505','12:30 - 13:30',NULL,'금','09:00 - 18:00'),(38,'2024-05-03 16:31:12.554132',6,'2024-05-03 16:31:12.554138',NULL,NULL,'토','09:00 - 12:00'),(39,'2024-05-03 16:31:12.555462',6,'2024-05-03 16:31:12.555468',NULL,NULL,'일','정기휴무 (매주 일요일)'),(40,'2024-05-03 16:31:12.557525',6,'2024-05-03 16:31:12.557531','12:30 - 13:30',NULL,'월','09:00 - 18:00'),(41,'2024-05-03 16:31:12.559511',6,'2024-05-03 16:31:12.559521','12:30 - 13:30',NULL,'화','09:00 - 18:00'),(42,'2024-05-03 16:31:12.561914',6,'2024-05-03 16:31:12.561921',NULL,NULL,'수(5/1)','휴무'),(43,'2024-05-03 16:31:12.587037',7,'2024-05-03 16:31:12.587043',NULL,NULL,'목','09:00 - 17:30'),(44,'2024-05-03 16:31:12.588886',7,'2024-05-03 16:31:12.588895',NULL,NULL,'금','09:00 - 17:30'),(45,'2024-05-03 16:31:12.590526',7,'2024-05-03 16:31:12.590532',NULL,NULL,'토','09:00 - 13:00'),(46,'2024-05-03 16:31:12.591753',7,'2024-05-03 16:31:12.591758',NULL,NULL,'일','정보없음'),(47,'2024-05-03 16:31:12.593033',7,'2024-05-03 16:31:12.593040',NULL,NULL,'월','09:00 - 17:30'),(48,'2024-05-03 16:31:12.594381',7,'2024-05-03 16:31:12.594389',NULL,NULL,'화','09:00 - 17:30'),(49,'2024-05-03 16:31:12.595731',7,'2024-05-03 16:31:12.595736',NULL,NULL,'수','09:00 - 17:30'),(50,'2024-05-03 16:31:12.608480',8,'2024-05-03 16:31:12.608487','13:00 - 14:00','17:20','목','09:00 - 18:00'),(51,'2024-05-03 16:31:12.610078',8,'2024-05-03 16:31:12.610084','13:00 - 14:00','17:20','금','09:00 - 18:00'),(52,'2024-05-03 16:31:12.612509',8,'2024-05-03 16:31:12.612515',NULL,'12:20','토','09:00 - 13:00'),(53,'2024-05-03 16:31:12.614053',8,'2024-05-03 16:31:12.614058',NULL,NULL,'일','정기휴무 (매주 일요일)'),(54,'2024-05-03 16:31:12.615337',8,'2024-05-03 16:31:12.615343','13:00 - 14:00','17:20','월','09:00 - 18:00'),(55,'2024-05-03 16:31:12.617436',8,'2024-05-03 16:31:12.617443','13:00 - 14:00','17:20','화','09:00 - 18:00'),(56,'2024-05-03 16:31:12.618863',8,'2024-05-03 16:31:12.618868','13:00 - 14:00','17:20','수','09:00 - 18:00'),(57,'2024-05-03 16:31:12.630614',9,'2024-05-03 16:31:12.630619',NULL,NULL,'목','09:00 - 18:00'),(58,'2024-05-03 16:31:12.631930',9,'2024-05-03 16:31:12.631935',NULL,NULL,'금','09:00 - 18:00'),(59,'2024-05-03 16:31:12.633743',9,'2024-05-03 16:31:12.633748',NULL,NULL,'토','09:00 - 13:00'),(60,'2024-05-03 16:31:12.635472',9,'2024-05-03 16:31:12.635476',NULL,NULL,'일','정기휴무 (매주 일요일)'),(61,'2024-05-03 16:31:12.636868',9,'2024-05-03 16:31:12.636873',NULL,NULL,'월','09:00 - 18:00'),(62,'2024-05-03 16:31:12.638073',9,'2024-05-03 16:31:12.638078',NULL,NULL,'화','09:00 - 18:00'),(63,'2024-05-03 16:31:12.639272',9,'2024-05-03 16:31:12.639277',NULL,NULL,'수','09:00 - 18:00'),(64,'2024-05-03 16:31:12.650961',10,'2024-05-03 16:31:12.650966',NULL,NULL,'목','09:00 - 18:00'),(65,'2024-05-03 16:31:12.652352',10,'2024-05-03 16:31:12.652357',NULL,NULL,'금','09:00 - 18:00'),(66,'2024-05-03 16:31:12.653700',10,'2024-05-03 16:31:12.653706',NULL,NULL,'토','09:00 - 13:00'),(67,'2024-05-03 16:31:12.654871',10,'2024-05-03 16:31:12.654876',NULL,NULL,'일','정기휴무 (매주 일요일)'),(68,'2024-05-03 16:31:12.656033',10,'2024-05-03 16:31:12.656038',NULL,NULL,'월','09:00 - 18:00'),(69,'2024-05-03 16:31:12.657146',10,'2024-05-03 16:31:12.657150',NULL,NULL,'화','09:00 - 18:00'),(70,'2024-05-03 16:31:12.658406',10,'2024-05-03 16:31:12.658411',NULL,NULL,'수','09:00 - 18:00'),(71,'2024-05-03 16:31:12.668119',11,'2024-05-03 16:31:12.668124',NULL,NULL,'매일','00:00 - 24:00'),(72,'2024-05-03 16:31:12.677720',12,'2024-05-03 16:31:12.677725','12:30 - 13:30','17:30','목','10:00 - 18:00'),(73,'2024-05-03 16:31:12.679008',12,'2024-05-03 16:31:12.679015','12:30 - 13:30','17:30','금','10:00 - 18:00'),(74,'2024-05-03 16:31:12.680136',12,'2024-05-03 16:31:12.680146',NULL,NULL,'토','정기휴무 (매주 토요일)'),(75,'2024-05-03 16:31:12.681494',12,'2024-05-03 16:31:12.681498',NULL,NULL,'일','정기휴무 (매주 일요일)'),(76,'2024-05-03 16:31:12.683990',12,'2024-05-03 16:31:12.683995','12:30 - 13:30','17:30','월','10:00 - 18:00'),(77,'2024-05-03 16:31:12.685503',12,'2024-05-03 16:31:12.685509','12:30 - 13:30','17:30','화','10:00 - 18:00'),(78,'2024-05-03 16:31:12.686655',12,'2024-05-03 16:31:12.686659',NULL,NULL,'수(5/1)','휴무'),(79,'2024-05-03 16:31:12.696625',13,'2024-05-03 16:31:12.696630',NULL,NULL,'목','10:00 - 17:00'),(80,'2024-05-03 16:31:12.697840',13,'2024-05-03 16:31:12.697844',NULL,NULL,'금','10:00 - 17:00'),(81,'2024-05-03 16:31:12.699646',13,'2024-05-03 16:31:12.699650',NULL,NULL,'토','정기휴무 (매주 토요일)'),(82,'2024-05-03 16:31:12.701330',13,'2024-05-03 16:31:12.701335',NULL,NULL,'일','정기휴무 (매주 일요일)'),(83,'2024-05-03 16:31:12.702920',13,'2024-05-03 16:31:12.702924',NULL,NULL,'월','10:00 - 17:00'),(84,'2024-05-03 16:31:12.704369',13,'2024-05-03 16:31:12.704374',NULL,NULL,'화','10:00 - 17:00'),(85,'2024-05-03 16:31:12.705751',13,'2024-05-03 16:31:12.705756',NULL,NULL,'수','10:00 - 17:00'),(86,'2024-05-03 16:31:12.743098',14,'2024-05-03 16:31:12.743110',NULL,NULL,'목','09:00 - 18:00'),(87,'2024-05-03 16:31:12.746919',14,'2024-05-03 16:31:12.746926',NULL,NULL,'금','09:00 - 18:00'),(88,'2024-05-03 16:31:12.750130',14,'2024-05-03 16:31:12.750144',NULL,NULL,'토','10:00 - 17:00'),(89,'2024-05-03 16:31:12.752805',14,'2024-05-03 16:31:12.752816',NULL,NULL,'일','10:00 - 17:00'),(90,'2024-05-03 16:31:12.755133',14,'2024-05-03 16:31:12.755139',NULL,NULL,'월','09:00 - 18:00'),(91,'2024-05-03 16:31:12.756768',14,'2024-05-03 16:31:12.756813',NULL,NULL,'화','09:00 - 18:00'),(92,'2024-05-03 16:31:12.760230',14,'2024-05-03 16:31:12.760235',NULL,NULL,'수','09:00 - 18:00'),(93,'2024-05-03 16:31:12.774955',15,'2024-05-03 16:31:12.774961',NULL,NULL,'목','09:00 - 18:00'),(94,'2024-05-03 16:31:12.776501',15,'2024-05-03 16:31:12.776505',NULL,NULL,'금','09:00 - 18:00'),(95,'2024-05-03 16:31:12.777963',15,'2024-05-03 16:31:12.777967',NULL,NULL,'토','09:00 - 13:00'),(96,'2024-05-03 16:31:12.780624',15,'2024-05-03 16:31:12.780629',NULL,NULL,'일','정보없음'),(97,'2024-05-03 16:31:12.781907',15,'2024-05-03 16:31:12.781912',NULL,NULL,'월','09:00 - 18:00'),(98,'2024-05-03 16:31:12.783461',15,'2024-05-03 16:31:12.783466',NULL,NULL,'화','09:00 - 18:00'),(99,'2024-05-03 16:31:12.784838',15,'2024-05-03 16:31:12.784842',NULL,NULL,'수','09:00 - 18:00'),(100,'2024-05-03 16:31:12.796669',16,'2024-05-03 16:31:12.796673',NULL,NULL,'목','09:00 - 18:00'),(101,'2024-05-03 16:31:12.798319',16,'2024-05-03 16:31:12.798323',NULL,NULL,'금','09:00 - 18:00'),(102,'2024-05-03 16:31:12.802450',16,'2024-05-03 16:31:12.802454',NULL,NULL,'토','정기휴무 (매주 토요일)'),(103,'2024-05-03 16:31:12.803710',16,'2024-05-03 16:31:12.803715',NULL,NULL,'일','정기휴무 (매주 일요일)'),(104,'2024-05-03 16:31:12.805079',16,'2024-05-03 16:31:12.805121',NULL,NULL,'월','09:00 - 18:00'),(105,'2024-05-03 16:31:12.807122',16,'2024-05-03 16:31:12.807264',NULL,NULL,'화','09:00 - 18:00'),(106,'2024-05-03 16:31:12.808502',16,'2024-05-03 16:31:12.808507',NULL,NULL,'수','09:00 - 18:00'),(107,'2024-05-03 16:31:12.843716',18,'2024-05-03 16:31:12.843722',NULL,NULL,'매일','00:00 - 24:00'),(108,'2024-05-03 16:31:12.858885',19,'2024-05-03 16:31:12.858892',NULL,NULL,'목','09:00 - 18:00'),(109,'2024-05-03 16:31:12.860530',19,'2024-05-03 16:31:12.860535',NULL,NULL,'금','09:00 - 18:00'),(110,'2024-05-03 16:31:12.861818',19,'2024-05-03 16:31:12.861821',NULL,NULL,'토','10:00 - 18:00'),(111,'2024-05-03 16:31:12.862922',19,'2024-05-03 16:31:12.862926',NULL,NULL,'일','10:00 - 18:00'),(112,'2024-05-03 16:31:12.864371',19,'2024-05-03 16:31:12.864375',NULL,NULL,'월','09:00 - 18:00'),(113,'2024-05-03 16:31:12.868092',19,'2024-05-03 16:31:12.868094',NULL,NULL,'화','09:00 - 18:00'),(114,'2024-05-03 16:31:12.869382',19,'2024-05-03 16:31:12.869386',NULL,NULL,'수','09:00 - 18:00'),(115,'2024-05-03 16:31:12.879758',20,'2024-05-03 16:31:12.879762','12:30 - 13:30',NULL,'목','09:00 - 18:00'),(116,'2024-05-03 16:31:12.880953',20,'2024-05-03 16:31:12.880956','12:30 - 13:30',NULL,'금','09:00 - 18:00'),(117,'2024-05-03 16:31:12.884579',20,'2024-05-03 16:31:12.884583',NULL,NULL,'토','09:00 - 12:00'),(118,'2024-05-03 16:31:12.885794',20,'2024-05-03 16:31:12.885798',NULL,NULL,'일','정기휴무 (매주 일요일)'),(119,'2024-05-03 16:31:12.886850',20,'2024-05-03 16:31:12.886854','12:30 - 13:30',NULL,'월','09:00 - 18:00'),(120,'2024-05-03 16:31:12.887899',20,'2024-05-03 16:31:12.887902','12:30 - 13:30',NULL,'화','09:00 - 18:00'),(121,'2024-05-03 16:31:12.888898',20,'2024-05-03 16:31:12.888902','12:30 - 13:30',NULL,'수','09:00 - 18:00'),(122,'2024-05-03 16:31:12.898864',21,'2024-05-03 16:31:12.898868','12:00 - 13:00',NULL,'목','09:00 - 18:00'),(123,'2024-05-03 16:31:12.900546',21,'2024-05-03 16:31:12.900549','12:00 - 13:00',NULL,'금','09:00 - 18:00'),(124,'2024-05-03 16:31:12.901747',21,'2024-05-03 16:31:12.901750',NULL,NULL,'토','09:00 - 11:30'),(125,'2024-05-03 16:31:12.902803',21,'2024-05-03 16:31:12.902806',NULL,NULL,'일','정기휴무 (매주 일요일)'),(126,'2024-05-03 16:31:12.903808',21,'2024-05-03 16:31:12.903811','12:00 - 13:00',NULL,'월','09:00 - 18:00'),(127,'2024-05-03 16:31:12.905488',21,'2024-05-03 16:31:12.905491','12:00 - 13:00',NULL,'화','09:00 - 18:00'),(128,'2024-05-03 16:31:12.906605',21,'2024-05-03 16:31:12.906608','12:00 - 13:00',NULL,'수','09:00 - 18:00'),(129,'2024-05-03 16:31:12.925789',23,'2024-05-03 16:31:12.925793','12:00 - 13:00',NULL,'매일','10:00 - 15:00'),(130,'2024-05-03 16:31:12.936579',24,'2024-05-03 16:31:12.936584',NULL,NULL,'목','09:00 - 20:00'),(131,'2024-05-03 16:31:12.938320',24,'2024-05-03 16:31:12.938324',NULL,NULL,'금','09:00 - 20:00'),(132,'2024-05-03 16:31:12.939942',24,'2024-05-03 16:31:12.939946',NULL,NULL,'토','09:00 - 18:00'),(133,'2024-05-03 16:31:12.941984',24,'2024-05-03 16:31:12.941988',NULL,NULL,'일','정기휴무 (매주 일요일)'),(134,'2024-05-03 16:31:12.942936',24,'2024-05-03 16:31:12.942939',NULL,NULL,'월','09:00 - 20:00'),(135,'2024-05-03 16:31:12.944074',24,'2024-05-03 16:31:12.944077',NULL,NULL,'화','09:00 - 20:00'),(136,'2024-05-03 16:31:12.945342',24,'2024-05-03 16:31:12.945345',NULL,NULL,'수','09:00 - 20:00'),(137,'2024-05-03 16:31:12.956875',25,'2024-05-03 16:31:12.956879',NULL,NULL,'목','09:00 - 16:30'),(138,'2024-05-03 16:31:12.958098',25,'2024-05-03 16:31:12.958101',NULL,NULL,'금','09:00 - 16:30'),(139,'2024-05-03 16:31:12.959122',25,'2024-05-03 16:31:12.959125',NULL,NULL,'토','정기휴무 (매주 토요일)'),(140,'2024-05-03 16:31:12.961270',25,'2024-05-03 16:31:12.961275',NULL,NULL,'일','정기휴무 (매주 일요일)'),(141,'2024-05-03 16:31:12.963560',25,'2024-05-03 16:31:12.963564',NULL,NULL,'월','09:00 - 16:30'),(142,'2024-05-03 16:31:12.966241',25,'2024-05-03 16:31:12.966245',NULL,NULL,'화','09:00 - 16:30'),(143,'2024-05-03 16:31:12.972939',25,'2024-05-03 16:31:12.972943',NULL,NULL,'수','09:00 - 16:30'),(144,'2024-05-03 16:31:12.987633',26,'2024-05-03 16:31:12.987637',NULL,NULL,'목','09:00 - 18:00'),(145,'2024-05-03 16:31:12.989004',26,'2024-05-03 16:31:12.989007',NULL,NULL,'금','09:00 - 18:00'),(146,'2024-05-03 16:31:12.990152',26,'2024-05-03 16:31:12.990156',NULL,NULL,'토','정기휴무 (매주 토요일)'),(147,'2024-05-03 16:31:12.991214',26,'2024-05-03 16:31:12.991217',NULL,NULL,'일','정기휴무 (매주 일요일)'),(148,'2024-05-03 16:31:12.992388',26,'2024-05-03 16:31:12.992391',NULL,NULL,'월','09:00 - 18:00'),(149,'2024-05-03 16:31:12.993482',26,'2024-05-03 16:31:12.993485',NULL,NULL,'화','09:00 - 18:00'),(150,'2024-05-03 16:31:12.994598',26,'2024-05-03 16:31:12.994602',NULL,NULL,'수','09:00 - 18:00'),(151,'2024-05-03 16:31:13.009672',27,'2024-05-03 16:31:13.009678','12:30 - 13:30',NULL,'목','09:00 - 18:00'),(152,'2024-05-03 16:31:13.018389',27,'2024-05-03 16:31:13.018396','12:30 - 13:30',NULL,'금','09:00 - 18:00'),(153,'2024-05-03 16:31:13.019914',27,'2024-05-03 16:31:13.019918',NULL,NULL,'토','09:00 - 13:00'),(154,'2024-05-03 16:31:13.021010',27,'2024-05-03 16:31:13.021013',NULL,NULL,'일','정기휴무 (매주 일요일)'),(155,'2024-05-03 16:31:13.022018',27,'2024-05-03 16:31:13.022022','12:30 - 13:30',NULL,'월','09:00 - 18:00'),(156,'2024-05-03 16:31:13.023231',27,'2024-05-03 16:31:13.023235','12:30 - 13:30',NULL,'화','09:00 - 18:00'),(157,'2024-05-03 16:31:13.024229',27,'2024-05-03 16:31:13.024233','12:30 - 13:30',NULL,'수','09:00 - 18:00'),(158,'2024-05-03 16:31:13.038970',28,'2024-05-03 16:31:13.038975',NULL,NULL,'목','09:00 - 17:30'),(159,'2024-05-03 16:31:13.040381',28,'2024-05-03 16:31:13.040384',NULL,NULL,'금','09:00 - 17:30'),(160,'2024-05-03 16:31:13.041631',28,'2024-05-03 16:31:13.041634',NULL,NULL,'토','09:00 - 13:00'),(161,'2024-05-03 16:31:13.042670',28,'2024-05-03 16:31:13.042673',NULL,NULL,'일','정보없음'),(162,'2024-05-03 16:31:13.043908',28,'2024-05-03 16:31:13.043912',NULL,NULL,'월','09:00 - 17:30'),(163,'2024-05-03 16:31:13.045015',28,'2024-05-03 16:31:13.045026',NULL,NULL,'화','09:00 - 17:30'),(164,'2024-05-03 16:31:13.046056',28,'2024-05-03 16:31:13.046061',NULL,NULL,'수','09:00 - 17:30'),(165,'2024-05-03 16:31:13.057269',29,'2024-05-03 16:31:13.057271',NULL,NULL,'목','09:30 - 18:30'),(166,'2024-05-03 16:31:13.058307',29,'2024-05-03 16:31:13.058309',NULL,NULL,'금','09:30 - 18:30'),(167,'2024-05-03 16:31:13.059243',29,'2024-05-03 16:31:13.059245',NULL,NULL,'토','정기휴무 (매주 토요일)'),(168,'2024-05-03 16:31:13.060318',29,'2024-05-03 16:31:13.060320',NULL,NULL,'일','정기휴무 (매주 일요일)'),(169,'2024-05-03 16:31:13.061250',29,'2024-05-03 16:31:13.061252',NULL,NULL,'월','09:30 - 18:30'),(170,'2024-05-03 16:31:13.062217',29,'2024-05-03 16:31:13.062219',NULL,NULL,'화','09:30 - 18:30'),(171,'2024-05-03 16:31:13.063193',29,'2024-05-03 16:31:13.063194',NULL,NULL,'수','09:30 - 18:30'),(172,'2024-05-03 16:31:13.073116',30,'2024-05-03 16:31:13.073118',NULL,NULL,'목','10:00 - 17:00'),(173,'2024-05-03 16:31:13.074147',30,'2024-05-03 16:31:13.074149',NULL,NULL,'금','10:00 - 17:00'),(174,'2024-05-03 16:31:13.075019',30,'2024-05-03 16:31:13.075020',NULL,NULL,'토','정기휴무 (매주 토요일)'),(175,'2024-05-03 16:31:13.075976',30,'2024-05-03 16:31:13.075978',NULL,NULL,'일','정기휴무 (매주 일요일)'),(176,'2024-05-03 16:31:13.077020',30,'2024-05-03 16:31:13.077021',NULL,NULL,'월','10:00 - 17:00'),(177,'2024-05-03 16:31:13.077871',30,'2024-05-03 16:31:13.077872',NULL,NULL,'화','10:00 - 17:00'),(178,'2024-05-03 16:31:13.078647',30,'2024-05-03 16:31:13.078649',NULL,NULL,'수','10:00 - 17:00');
/*!40000 ALTER TABLE `clinic_hours` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `clinic_hours_seq`
--

DROP TABLE IF EXISTS `clinic_hours_seq`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `clinic_hours_seq` (
  `next_val` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `clinic_hours_seq`
--

LOCK TABLES `clinic_hours_seq` WRITE;
/*!40000 ALTER TABLE `clinic_hours_seq` DISABLE KEYS */;
INSERT INTO `clinic_hours_seq` VALUES (251);
/*!40000 ALTER TABLE `clinic_hours_seq` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `enroll`
--

DROP TABLE IF EXISTS `enroll`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `enroll` (
  `enroll_status` tinyint(4) DEFAULT NULL,
  `created_at` datetime(6) DEFAULT NULL,
  `enroll_id` bigint(20) NOT NULL,
  `hospital_id` bigint(20) DEFAULT NULL,
  `relation_id` bigint(20) DEFAULT NULL,
  `start_time` datetime(6) DEFAULT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  PRIMARY KEY (`enroll_id`),
  KEY `FKep0mkfc186r4fyv9gf3jkup1a` (`hospital_id`),
  KEY `FKcyp0wbt18d3y10kcbpkijivd1` (`relation_id`),
  CONSTRAINT `FKcyp0wbt18d3y10kcbpkijivd1` FOREIGN KEY (`relation_id`) REFERENCES `relation` (`relation_id`),
  CONSTRAINT `FKep0mkfc186r4fyv9gf3jkup1a` FOREIGN KEY (`hospital_id`) REFERENCES `hospital` (`hospital_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `enroll`
--

LOCK TABLES `enroll` WRITE;
/*!40000 ALTER TABLE `enroll` DISABLE KEYS */;
/*!40000 ALTER TABLE `enroll` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `enroll_seq`
--

DROP TABLE IF EXISTS `enroll_seq`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `enroll_seq` (
  `next_val` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `enroll_seq`
--

LOCK TABLES `enroll_seq` WRITE;
/*!40000 ALTER TABLE `enroll_seq` DISABLE KEYS */;
INSERT INTO `enroll_seq` VALUES (1);
/*!40000 ALTER TABLE `enroll_seq` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hospital`
--

DROP TABLE IF EXISTS `hospital`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hospital` (
  `created_at` datetime(6) DEFAULT NULL,
  `hospital_id` bigint(20) NOT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `category` varchar(255) DEFAULT NULL,
  `convenience` varchar(255) DEFAULT NULL,
  `doctors` varchar(255) DEFAULT NULL,
  `latitude` varchar(255) DEFAULT NULL,
  `longitude` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `parking` varchar(255) DEFAULT NULL,
  `subject` varchar(255) DEFAULT NULL,
  `tel` varchar(255) DEFAULT NULL,
  `website` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`hospital_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hospital`
--

LOCK TABLES `hospital` WRITE;
/*!40000 ALTER TABLE `hospital` DISABLE KEYS */;
INSERT INTO `hospital` VALUES ('2024-05-03 16:31:12.370653',1,'2024-05-03 16:31:12.370682','경기 고양시 일산서구 덕이로 212 백송프라자','요양병원','남/녀 화장실 구분|||장애인 휠체어 이용가능|||출입구 휠체어 이용가능|||좌석 휠체어 이용가능|||장애인 주차구역','가정의학과전문의 5명','37.6970240','126.7390830','무지개요양병원','주차불가','가정의학과|||한방내과','031-916-1122',NULL),('2024-05-03 16:31:12.428192',2,'2024-05-03 16:31:12.428215','경기 고양시 일산동구 장백로 174 지하1층~10층','요양병원','무선 인터넷|||남/녀 화장실 구분|||장애인 휠체어 이용가능|||출입구 휠체어 이용가능|||장애인 주차구역','가정의학과전문의 2명','37.6504751','126.7776368','연세나을요양병원','주차가능\n무료','가정의학과|||한방내과','0507-1336-4188',NULL),('2024-05-03 16:31:12.462815',3,'2024-05-03 16:31:12.462829','경기 고양시 일산동구 일산로 439','요양병원','남/녀 화장실 구분|||장애인 주차구역','산부인과전문의 2명, 영상의학과전문의 1명','37.6729980','126.7780076','동원요양병원','주차가능','산부인과|||영상의학과|||가정의학과|||내과|||한방내과','0507-1494-7006',NULL),('2024-05-03 16:31:12.488017',4,'2024-05-03 16:31:12.488027','경기 고양시 일산동구 중앙로 1312','요양병원','남/녀 화장실 구분|||단체 이용 가능|||예약|||무선 인터넷|||장애인 주차구역','산부인과전문의 1명','37.6630287','126.7710812','차연요양병원','주차가능','산부인과|||한방내과','0507-1377-1058',NULL),('2024-05-03 16:31:12.516287',5,'2024-05-03 16:31:12.516298','경기 고양시 일산서구 주화로 88 효림빌딩','요양병원','남/녀 화장실 구분|||무선 인터넷|||장애인 주차구역','가정의학과전문의 2명','37.6704860','126.7584407','효림요양병원','주차가능\n무료','가정의학과|||내과|||사상체질과|||신경과|||외과|||재활의학과|||침구과|||피부과|||한방내과|||한방신경정신과|||한방재활의학과','031-919-0041',NULL),('2024-05-03 16:31:12.548419',6,'2024-05-03 16:31:12.548449','경기 고양시 일산동구 장백로 86 한경프라자 3층~7층','요양병원','무선 인터넷|||예약|||방문접수/출장|||남/녀 화장실 구분|||장애인 주차구역','내과전문의 2명, 재활의학과전문의 1명','37.6447214','126.7844063','일산사랑요양병원','주차가능','내과|||재활의학과|||소아청소년과|||신경외과|||외과|||이비인후과|||정형외과|||한방내과','0507-1315-8120',NULL),('2024-05-03 16:31:12.584921',7,'2024-05-03 16:31:12.584930','경기 고양시 일산동구 무궁화로 346 지하1~2층,1~3층','요양병원','무선 인터넷|||남/녀 화장실 구분|||장애인 주차구역','내과전문의 2명, 재활의학과전문의 1명','37.6766556','126.7981216','일산현대요양병원','주차가능','내과|||재활의학과|||가정의학과|||병리과|||비뇨의학과|||소아청소년과|||신경과|||영상의학과|||이비인후과|||피부과|||한방내과','031-922-7575',NULL),('2024-05-03 16:31:12.606782',8,'2024-05-03 16:31:12.606789','경기 고양시 일산동구 성현로29번길 28-9','요양병원',NULL,NULL,'37.7119940','126.7912256','다스람요양병원',NULL,NULL,'1800-5173',NULL),('2024-05-03 16:31:12.629084',9,'2024-05-03 16:31:12.629091','경기 고양시 일산서구 일중로 59 일산마샬빌딩','요양병원',NULL,'내과전문의 1명','37.6849626','126.7752334','로하스일산요양병원',NULL,'내과|||가정의학과|||재활의학과|||한방내과','031-976-2200',NULL),('2024-05-03 16:31:12.649151',10,'2024-05-03 16:31:12.649159','경기 고양시 덕양구 향동로 123 전관','요양병원','예약|||장애인 휠체어 이용가능|||출입구 휠체어 이용가능|||좌석 휠체어 이용가능|||장애인 주차구역',NULL,'37.6008956','126.8892014','향동포레요양병원','주차가능\n무료',NULL,'02-3158-3335',NULL),('2024-05-03 16:31:12.666483',11,'2024-05-03 16:31:12.666488','경기 고양시 덕양구 토당로67번길 2','요양병원','무선 인터넷|||남/녀 화장실 구분|||장애인 주차구역',NULL,'37.6215250','126.8184670','새찬요양병원','주차가능',NULL,'031-979-2119',NULL),('2024-05-03 16:31:12.675909',12,'2024-05-03 16:31:12.675913','경기 고양시 일산동구 고봉로 20-21 양우로데오랜드 B동 3F~5F','요양병원',NULL,'정형외과전문의 2명, 내과전문의 1명','37.6636899','126.7655568','자애요양병원','주차가능\n무료','정형외과|||내과|||가정의학과|||신경외과|||외과|||재활의학과|||한방내과','031-919-9942',NULL),('2024-05-03 16:31:12.694848',13,'2024-05-03 16:31:12.694853','경기 고양시 일산동구 중앙로 1124 흰돌마을상가 4층','요양병원','예약|||남/녀 화장실 구분|||무선 인터넷|||장애인 주차구역','가정의학과전문의 1명, 내과전문의 1명 외 전문의 1명','37.6483477','126.7816726','이푸른요양병원','주차가능','가정의학과|||내과|||재활의학과|||신경과|||신경외과|||외과|||정형외과|||침구과','0507-1443-3340',NULL),('2024-05-03 16:31:12.719211',14,'2024-05-03 16:31:12.719218','경기 고양시 일산동구 하늘마을1로 14 일산 조은프라자','요양병원','남/녀 화장실 구분','가정의학과전문의 1명, 재활의학과전문의 1명','37.6749414','126.7869830','일산아르고요양병원','주차가능','가정의학과|||재활의학과|||내과|||신경과|||한방내과','0507-1359-1844',NULL),('2024-05-03 16:31:12.773227',15,'2024-05-03 16:31:12.773233','경기 고양시 덕양구 중앙로 620','요양병원','남/녀 화장실 구분|||예약|||장애인 주차구역','가정의학과전문의 1명, 재활의학과전문의 1명','37.6271987','126.8299415','고양센트럴요양병원','주차가능','가정의학과|||재활의학과|||한방내과|||내과|||사상체질과|||신경과|||신경외과|||심장혈관흉부외과|||외과|||응급의학과|||정형외과|||침구과|||피부과|||한방부인과|||한방소아과|||한방신경정신과|||한방안·이비인후·피부과|||한방재활의학과','0507-1399-7809',NULL),('2024-05-03 16:31:12.793486',16,'2024-05-03 16:31:12.793489','경기 고양시 덕양구 호국로 804 원당타운','요양병원','예약','가정의학과전문의 1명, 재활의학과전문의 1명','37.6574779','126.8375919','로하스클로버요양병원','주차가능','가정의학과|||재활의학과|||내과|||비뇨의학과|||영상의학과|||예방의학과|||외과|||이비인후과|||정신건강의학과|||정형외과|||침구과|||피부과|||한방내과|||한방재활의학과','031-967-5050',NULL),('2024-05-03 16:31:12.818948',17,'2024-05-03 16:31:12.818952','경기 고양시 일산서구 중앙로 1564 그린월드','요양병원','남/녀 화장실 구분',NULL,'37.6760623','126.7483261','일산메디안요양병원','주차가능','가정의학과|||내과|||신경과|||재활의학과|||비뇨의학과|||소아청소년과|||신경외과|||외과|||이비인후과|||정형외과|||피부과|||한방내과','031-913-3119',NULL),('2024-05-03 16:31:12.837473',18,'2024-05-03 16:31:12.837484','경기 고양시 일산동구 무궁화로 31-16 남정시티프라자 8차','요양병원','남/녀 화장실 구분',NULL,'37.6635029','126.7677200','일산참사랑요양병원','주차가능','한방재활의학과|||가정의학과|||내과|||비뇨의학과|||신경과|||이비인후과|||재활의학과|||피부과','031-918-1070',NULL),('2024-05-03 16:31:12.856368',19,'2024-05-03 16:31:12.856375','경기 고양시 일산동구 성현로377번길 128-4','요양병원','단체 이용 가능|||무선 인터넷|||유아시설 (놀이방)|||남/녀 화장실 구분|||장애인 주차구역','가정의학과전문의 1명, 심장혈관흉부외과전문의 1명','37.7004067','126.8332467','정안요양병원','주차가능\n무료','가정의학과|||심장혈관흉부외과|||내과|||사상체질과|||신경과|||정형외과|||침구과|||한방내과','031-977-8757',NULL),('2024-05-03 16:31:12.878264',20,'2024-05-03 16:31:12.878269','경기 고양시 덕양구 중앙로557번길 7-14 원스톱라이프상가','요양병원','예약|||방문접수/출장','산부인과전문의 2명, 내과전문의 1명 외 전문의 2명','37.6227551','126.8353994','강북성심요양병원','주차가능','산부인과|||내과|||신경과|||재활의학과|||가정의학과|||비뇨의학과|||소아청소년과|||이비인후과|||침구과|||피부과','031-978-1122',NULL),('2024-05-03 16:31:12.897386',21,'2024-05-03 16:31:12.897408','경기 고양시 일산동구 백마로 490','요양병원','남/녀 화장실 구분|||무선 인터넷|||예약|||대기공간|||장애인 휠체어 이용가능|||출입구 휠체어 이용가능|||장애인 주차구역',NULL,'37.6617556','126.8032749','자향요양병원','주차가능\n무료','마취통증의학과|||방사선종양학과|||외과|||한방내과','1661-8927',NULL),('2024-05-03 16:31:12.915887',22,'2024-05-03 16:31:12.915892','경기 고양시 일산동구 위시티로 18 동국타워','요양병원','남/녀 화장실 구분',NULL,'37.6745785','126.8075370','일산리더스요양병원','주차가능','가정의학과|||내과|||침구과|||한방내과','031-962-0050',NULL),('2024-05-03 16:31:12.924386',23,'2024-05-03 16:31:12.924390','경기 고양시 덕양구 내유길 146-19','요양병원','예약',NULL,'37.7231257','126.8645475','의료법인에덴재단행복한요양병원','주차가능','내과|||신경과|||재활의학과|||침구과|||한방내과|||한방재활의학과','031-963-5600',NULL),('2024-05-03 16:31:12.935028',24,'2024-05-03 16:31:12.935033','경기 고양시 일산동구 고봉로 467-57 가동 지하1층~지상3층','요양병원',NULL,'방사선종양학과전문의 1명','37.7004559','126.7789872','다나은요양병원','주차가능\n무료','방사선종양학과|||한방내과|||내과|||신경과|||신경외과|||외과|||재활의학과|||정형외과','0507-1458-1360',NULL),('2024-05-03 16:31:12.955421',25,'2024-05-03 16:31:12.955426','경기 고양시 일산서구 고봉로 291 에이스스타디움','요양병원','남/녀 화장실 구분','외과전문의 2명','37.6851029','126.7772182','일산한울요양병원','주차가능','외과|||내과|||재활의학과|||침구과','031-975-3700',NULL),('2024-05-03 16:31:12.986313',26,'2024-05-03 16:31:12.986319','경기 고양시 일산동구 숲속마을로 18 웰빙타운','요양병원','예약|||방문접수/출장|||무선 인터넷|||남/녀 화장실 구분|||장애인 주차구역','가정의학과전문의 2명, 재활의학과전문의 1명','37.6672206','126.8013215','동국마음요양병원','주차가능','가정의학과|||재활의학과|||한방재활의학과|||내과|||외과','031-811-9900',NULL),('2024-05-03 16:31:13.008176',27,'2024-05-03 16:31:13.008182','경기 고양시 일산서구 일현로 53 메디누리','요양병원','남/녀 화장실 구분','신경외과전문의 1명, 외과전문의 1명','37.6920181','126.7630329','메디누리요양병원','주차가능','신경외과|||외과|||가정의학과|||내과|||비뇨의학과|||재활의학과|||정형외과|||침구과|||피부과|||한방내과|||한방부인과|||한방신경정신과|||한방안·이비인후·피부과|||한방재활의학과','031-925-7575',NULL),('2024-05-03 16:31:13.035698',28,'2024-05-03 16:31:13.035704','경기 고양시 덕양구 지도로 100','요양병원',NULL,NULL,'37.6261199','126.8240908','삼성요양병원','주차가능','내과|||비뇨의학과|||신경과|||이비인후과|||재활의학과|||침구과|||피부과|||한방내과|||한방부인과','031-972-5678',NULL),('2024-05-03 16:31:13.055832',29,'2024-05-03 16:31:13.055858','경기 고양시 덕양구 중앙로 478 행신미원프라자','요양병원',NULL,'가정의학과전문의 2명, 내과전문의 1명','37.6194397','126.8426343','효그린요양병원',NULL,'가정의학과|||내과|||비뇨의학과|||사상체질과|||소아청소년과|||신경과|||외과|||이비인후과|||재활의학과|||정신건강의학과|||침구과|||피부과|||한방내과|||한방소아과|||한방재활의학과','031-979-0808',NULL),('2024-05-03 16:31:13.071789',30,'2024-05-03 16:31:13.071791','경기 고양시 일산동구 호수로 646-24 위너스21-II','요양병원','남/녀 화장실 구분',NULL,'37.6596790','126.7680799','일산호수요양병원','주차가능','내과|||소아청소년과|||신경과|||신경외과|||재활의학과|||정형외과|||침구과|||한방내과','031-903-8275',NULL);
/*!40000 ALTER TABLE `hospital` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hospital_seq`
--

DROP TABLE IF EXISTS `hospital_seq`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hospital_seq` (
  `next_val` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hospital_seq`
--

LOCK TABLES `hospital_seq` WRITE;
/*!40000 ALTER TABLE `hospital_seq` DISABLE KEYS */;
INSERT INTO `hospital_seq` VALUES (101);
/*!40000 ALTER TABLE `hospital_seq` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `member`
--

DROP TABLE IF EXISTS `member`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `member` (
  `created_at` datetime(6) DEFAULT NULL,
  `member_id` bigint(20) NOT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `role` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `username` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`member_id`),
  UNIQUE KEY `UK_mbmcqelty0fbrvxp1q58dn57t` (`email`),
  UNIQUE KEY `UK_6ithqvsvrcawbi9dtxu0ttsny` (`phone`),
  UNIQUE KEY `UK_gc3jmn7c2abyo3wf6syln5t2i` (`username`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `member`
--

LOCK TABLES `member` WRITE;
/*!40000 ALTER TABLE `member` DISABLE KEYS */;
INSERT INTO `member` VALUES ('2024-05-03 16:30:30.692721',1,'2024-05-03 16:30:30.692766',NULL,'wkwk2805u@naver.com',NULL,NULL,NULL,NULL,'naver','naver_njxCNyK7eUlkNB');
/*!40000 ALTER TABLE `member` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `member_seq`
--

DROP TABLE IF EXISTS `member_seq`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `member_seq` (
  `next_val` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `member_seq`
--

LOCK TABLES `member_seq` WRITE;
/*!40000 ALTER TABLE `member_seq` DISABLE KEYS */;
INSERT INTO `member_seq` VALUES (51);
/*!40000 ALTER TABLE `member_seq` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `patient`
--

DROP TABLE IF EXISTS `patient`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `patient` (
  `created_at` datetime(6) DEFAULT NULL,
  `patient_id` bigint(20) NOT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `grade` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`patient_id`),
  UNIQUE KEY `UK_9gxe97j2ngjjvtkig6b6jvy91` (`phone`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `patient`
--

LOCK TABLES `patient` WRITE;
/*!40000 ALTER TABLE `patient` DISABLE KEYS */;
/*!40000 ALTER TABLE `patient` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `patient_seq`
--

DROP TABLE IF EXISTS `patient_seq`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `patient_seq` (
  `next_val` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `patient_seq`
--

LOCK TABLES `patient_seq` WRITE;
/*!40000 ALTER TABLE `patient_seq` DISABLE KEYS */;
INSERT INTO `patient_seq` VALUES (1);
/*!40000 ALTER TABLE `patient_seq` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `relation`
--

DROP TABLE IF EXISTS `relation`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `relation` (
  `created_at` datetime(6) DEFAULT NULL,
  `member_id` bigint(20) DEFAULT NULL,
  `patient_id` bigint(20) DEFAULT NULL,
  `relation_id` bigint(20) NOT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  PRIMARY KEY (`relation_id`),
  UNIQUE KEY `UKftlu0lgfowee6gqhvqkbynqkm` (`member_id`,`patient_id`),
  KEY `FKeo1qrcriftb7gphcyfmn1p3vm` (`patient_id`),
  CONSTRAINT `FKeo1qrcriftb7gphcyfmn1p3vm` FOREIGN KEY (`patient_id`) REFERENCES `patient` (`patient_id`),
  CONSTRAINT `FKp24mb4xg52q79wh8744ca90a3` FOREIGN KEY (`member_id`) REFERENCES `member` (`member_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `relation`
--

LOCK TABLES `relation` WRITE;
/*!40000 ALTER TABLE `relation` DISABLE KEYS */;
/*!40000 ALTER TABLE `relation` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `relation_seq`
--

DROP TABLE IF EXISTS `relation_seq`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `relation_seq` (
  `next_val` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `relation_seq`
--

LOCK TABLES `relation_seq` WRITE;
/*!40000 ALTER TABLE `relation_seq` DISABLE KEYS */;
INSERT INTO `relation_seq` VALUES (1);
/*!40000 ALTER TABLE `relation_seq` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-05-03 16:33:40
