-- MySQL dump 10.13  Distrib 8.3.0, for macos14.2 (arm64)
--
-- Host: localhost    Database: nursing-home
-- ------------------------------------------------------
-- Server version	5.7.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `clinic_hours`
--

DROP TABLE IF EXISTS `clinic_hours`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `clinic_hours` (
  `clinic_hours_id` bigint(20) NOT NULL,
  `created_at` datetime(6) DEFAULT NULL,
  `hospital_id` bigint(20) DEFAULT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  `break_time` varchar(255) DEFAULT NULL,
  `deadline_time` varchar(255) DEFAULT NULL,
  `week_name` varchar(255) DEFAULT NULL,
  `week_time` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`clinic_hours_id`),
  KEY `FK1brbpyo35p1g3nk5hg9yu55ma` (`hospital_id`),
  CONSTRAINT `FK1brbpyo35p1g3nk5hg9yu55ma` FOREIGN KEY (`hospital_id`) REFERENCES `hospital` (`hospital_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `clinic_hours`
--

LOCK TABLES `clinic_hours` WRITE;
/*!40000 ALTER TABLE `clinic_hours` DISABLE KEYS */;
INSERT INTO `clinic_hours` VALUES (1,'2024-05-22 16:02:45.661345',1,'2024-05-22 16:02:45.661363',NULL,NULL,'목','09:00 - 18:00'),(2,'2024-05-22 16:02:45.667588',1,'2024-05-22 16:02:45.667603',NULL,NULL,'금','09:00 - 18:00'),(3,'2024-05-22 16:02:45.670811',1,'2024-05-22 16:02:45.670825',NULL,NULL,'토','09:00 - 12:30'),(4,'2024-05-22 16:02:45.676533',1,'2024-05-22 16:02:45.676572',NULL,NULL,'일','정기휴무 (매주 일요일)'),(5,'2024-05-22 16:02:45.679179',1,'2024-05-22 16:02:45.679201',NULL,NULL,'월','09:00 - 18:00'),(6,'2024-05-22 16:02:45.682559',1,'2024-05-22 16:02:45.682574',NULL,NULL,'화','09:00 - 18:00'),(7,'2024-05-22 16:02:45.685533',1,'2024-05-22 16:02:45.685545',NULL,NULL,'수','09:00 - 18:00'),(8,'2024-05-22 16:02:45.705804',2,'2024-05-22 16:02:45.705818','13:00 - 14:00',NULL,'목','09:00 - 18:00'),(9,'2024-05-22 16:02:45.707787',2,'2024-05-22 16:02:45.707799','13:00 - 14:00',NULL,'금','09:00 - 18:00'),(10,'2024-05-22 16:02:45.709594',2,'2024-05-22 16:02:45.709607','13:00 - 14:00',NULL,'토','10:00 - 16:00'),(11,'2024-05-22 16:02:45.711348',2,'2024-05-22 16:02:45.711361','13:00 - 14:00',NULL,'일','10:00 - 16:00'),(12,'2024-05-22 16:02:45.714466',2,'2024-05-22 16:02:45.714493','13:00 - 14:00',NULL,'월','09:00 - 18:00'),(13,'2024-05-22 16:02:45.716878',2,'2024-05-22 16:02:45.716891','13:00 - 14:00',NULL,'화','09:00 - 18:00'),(14,'2024-05-22 16:02:45.718894',2,'2024-05-22 16:02:45.718905','13:00 - 14:00',NULL,'수','09:00 - 18:00'),(15,'2024-05-22 16:02:45.736834',3,'2024-05-22 16:02:45.736948',NULL,NULL,'목','09:00 - 18:00'),(16,'2024-05-22 16:02:45.739950',3,'2024-05-22 16:02:45.739979',NULL,NULL,'금','09:00 - 18:00'),(17,'2024-05-22 16:02:45.742698',3,'2024-05-22 16:02:45.742708',NULL,NULL,'토','09:00 - 13:00'),(18,'2024-05-22 16:02:45.745813',3,'2024-05-22 16:02:45.745828',NULL,NULL,'일','정기휴무 (매주 일요일)'),(19,'2024-05-22 16:02:45.748682',3,'2024-05-22 16:02:45.748700',NULL,NULL,'월','09:00 - 18:00'),(20,'2024-05-22 16:02:45.752620',3,'2024-05-22 16:02:45.752641',NULL,NULL,'화','09:00 - 18:00'),(21,'2024-05-22 16:02:45.755536',3,'2024-05-22 16:02:45.755551',NULL,NULL,'수','09:00 - 18:00'),(22,'2024-05-22 16:02:45.778660',4,'2024-05-22 16:02:45.778736','13:00 - 14:00',NULL,'목','09:30 - 18:30'),(23,'2024-05-22 16:02:45.782143',4,'2024-05-22 16:02:45.782151','13:00 - 14:00',NULL,'금','09:30 - 18:30'),(24,'2024-05-22 16:02:45.785563',4,'2024-05-22 16:02:45.785570',NULL,NULL,'토','정기휴무 (매주 토요일)'),(25,'2024-05-22 16:02:45.787764',4,'2024-05-22 16:02:45.787773',NULL,NULL,'일','정기휴무 (매주 일요일)'),(26,'2024-05-22 16:02:45.789784',4,'2024-05-22 16:02:45.789814','13:00 - 14:00',NULL,'월','09:30 - 18:30'),(27,'2024-05-22 16:02:45.792118',4,'2024-05-22 16:02:45.792125','13:00 - 14:00',NULL,'화','09:30 - 18:30'),(28,'2024-05-22 16:02:45.794900',4,'2024-05-22 16:02:45.794907','13:00 - 14:00',NULL,'수','09:30 - 18:30'),(29,'2024-05-22 16:02:45.821524',5,'2024-05-22 16:02:45.821535','12:00 - 13:00',NULL,'목','09:00 - 18:00'),(30,'2024-05-22 16:02:45.825040',5,'2024-05-22 16:02:45.825049','12:00 - 13:00',NULL,'금','09:00 - 18:00'),(31,'2024-05-22 16:02:45.828041',5,'2024-05-22 16:02:45.828049','12:00 - 13:00',NULL,'토','10:00 - 17:00'),(32,'2024-05-22 16:02:45.832975',5,'2024-05-22 16:02:45.833124',NULL,NULL,'일','정기휴무 (매주 일요일)'),(33,'2024-05-22 16:02:45.836940',5,'2024-05-22 16:02:45.836947','12:00 - 13:00',NULL,'월','09:00 - 18:00'),(34,'2024-05-22 16:02:45.839060',5,'2024-05-22 16:02:45.839066','12:00 - 13:00',NULL,'화','09:00 - 18:00'),(35,'2024-05-22 16:02:45.841118',5,'2024-05-22 16:02:45.841124','12:00 - 13:00',NULL,'수','09:00 - 18:00'),(36,'2024-05-22 16:02:45.854112',6,'2024-05-22 16:02:45.854118','12:30 - 13:30',NULL,'목','09:00 - 18:00'),(37,'2024-05-22 16:02:45.855736',6,'2024-05-22 16:02:45.855743','12:30 - 13:30',NULL,'금','09:00 - 18:00'),(38,'2024-05-22 16:02:45.857240',6,'2024-05-22 16:02:45.857246',NULL,NULL,'토','09:00 - 12:00'),(39,'2024-05-22 16:02:45.858776',6,'2024-05-22 16:02:45.858782',NULL,NULL,'일','정기휴무 (매주 일요일)'),(40,'2024-05-22 16:02:45.860205',6,'2024-05-22 16:02:45.860212','12:30 - 13:30',NULL,'월','09:00 - 18:00'),(41,'2024-05-22 16:02:45.861725',6,'2024-05-22 16:02:45.861738','12:30 - 13:30',NULL,'화','09:00 - 18:00'),(42,'2024-05-22 16:02:45.863135',6,'2024-05-22 16:02:45.863141',NULL,NULL,'수(5/1)','휴무'),(43,'2024-05-22 16:02:45.878156',7,'2024-05-22 16:02:45.878162',NULL,NULL,'목','09:00 - 17:30'),(44,'2024-05-22 16:02:45.879848',7,'2024-05-22 16:02:45.879854',NULL,NULL,'금','09:00 - 17:30'),(45,'2024-05-22 16:02:45.881370',7,'2024-05-22 16:02:45.881375',NULL,NULL,'토','09:00 - 13:00'),(46,'2024-05-22 16:02:45.882821',7,'2024-05-22 16:02:45.882828',NULL,NULL,'일','정보없음'),(47,'2024-05-22 16:02:45.884458',7,'2024-05-22 16:02:45.884465',NULL,NULL,'월','09:00 - 17:30'),(48,'2024-05-22 16:02:45.886145',7,'2024-05-22 16:02:45.886153',NULL,NULL,'화','09:00 - 17:30'),(49,'2024-05-22 16:02:45.887796',7,'2024-05-22 16:02:45.887802',NULL,NULL,'수','09:00 - 17:30'),(50,'2024-05-22 16:02:45.900872',8,'2024-05-22 16:02:45.900878','13:00 - 14:00','17:20','목','09:00 - 18:00'),(51,'2024-05-22 16:02:45.902873',8,'2024-05-22 16:02:45.902879','13:00 - 14:00','17:20','금','09:00 - 18:00'),(52,'2024-05-22 16:02:45.906819',8,'2024-05-22 16:02:45.906826',NULL,'12:20','토','09:00 - 13:00'),(53,'2024-05-22 16:02:45.909224',8,'2024-05-22 16:02:45.909231',NULL,NULL,'일','정기휴무 (매주 일요일)'),(54,'2024-05-22 16:02:45.911785',8,'2024-05-22 16:02:45.911791','13:00 - 14:00','17:20','월','09:00 - 18:00'),(55,'2024-05-22 16:02:45.917381',8,'2024-05-22 16:02:45.917389','13:00 - 14:00','17:20','화','09:00 - 18:00'),(56,'2024-05-22 16:02:45.918981',8,'2024-05-22 16:02:45.918988','13:00 - 14:00','17:20','수','09:00 - 18:00'),(57,'2024-05-22 16:02:45.929956',9,'2024-05-22 16:02:45.929961',NULL,NULL,'목','09:00 - 18:00'),(58,'2024-05-22 16:02:45.931231',9,'2024-05-22 16:02:45.931237',NULL,NULL,'금','09:00 - 18:00'),(59,'2024-05-22 16:02:45.933120',9,'2024-05-22 16:02:45.933125',NULL,NULL,'토','09:00 - 13:00'),(60,'2024-05-22 16:02:45.936198',9,'2024-05-22 16:02:45.936204',NULL,NULL,'일','정기휴무 (매주 일요일)'),(61,'2024-05-22 16:02:45.937531',9,'2024-05-22 16:02:45.937537',NULL,NULL,'월','09:00 - 18:00'),(62,'2024-05-22 16:02:45.938943',9,'2024-05-22 16:02:45.938948',NULL,NULL,'화','09:00 - 18:00'),(63,'2024-05-22 16:02:45.940153',9,'2024-05-22 16:02:45.940157',NULL,NULL,'수','09:00 - 18:00'),(64,'2024-05-22 16:02:45.955238',10,'2024-05-22 16:02:45.955244',NULL,NULL,'목','09:00 - 18:00'),(65,'2024-05-22 16:02:45.956669',10,'2024-05-22 16:02:45.956674',NULL,NULL,'금','09:00 - 18:00'),(66,'2024-05-22 16:02:45.958200',10,'2024-05-22 16:02:45.958206',NULL,NULL,'토','09:00 - 13:00'),(67,'2024-05-22 16:02:45.959946',10,'2024-05-22 16:02:45.959951',NULL,NULL,'일','정기휴무 (매주 일요일)'),(68,'2024-05-22 16:02:45.962213',10,'2024-05-22 16:02:45.962219',NULL,NULL,'월','09:00 - 18:00'),(69,'2024-05-22 16:02:45.965028',10,'2024-05-22 16:02:45.965034',NULL,NULL,'화','09:00 - 18:00'),(70,'2024-05-22 16:02:45.967732',10,'2024-05-22 16:02:45.967738',NULL,NULL,'수','09:00 - 18:00'),(71,'2024-05-22 16:02:45.984776',11,'2024-05-22 16:02:45.984783',NULL,NULL,'매일','00:00 - 24:00'),(72,'2024-05-22 16:02:46.006782',12,'2024-05-22 16:02:46.006790','12:30 - 13:30','17:30','목','10:00 - 18:00'),(73,'2024-05-22 16:02:46.008482',12,'2024-05-22 16:02:46.008494','12:30 - 13:30','17:30','금','10:00 - 18:00'),(74,'2024-05-22 16:02:46.010025',12,'2024-05-22 16:02:46.010036',NULL,NULL,'토','정기휴무 (매주 토요일)'),(75,'2024-05-22 16:02:46.011899',12,'2024-05-22 16:02:46.011904',NULL,NULL,'일','정기휴무 (매주 일요일)'),(76,'2024-05-22 16:02:46.013427',12,'2024-05-22 16:02:46.013440','12:30 - 13:30','17:30','월','10:00 - 18:00'),(77,'2024-05-22 16:02:46.015685',12,'2024-05-22 16:02:46.015692','12:30 - 13:30','17:30','화','10:00 - 18:00'),(78,'2024-05-22 16:02:46.017795',12,'2024-05-22 16:02:46.017801',NULL,NULL,'수(5/1)','휴무'),(79,'2024-05-22 16:02:46.033522',13,'2024-05-22 16:02:46.033538',NULL,NULL,'목','10:00 - 17:00'),(80,'2024-05-22 16:02:46.034978',13,'2024-05-22 16:02:46.034984',NULL,NULL,'금','10:00 - 17:00'),(81,'2024-05-22 16:02:46.036740',13,'2024-05-22 16:02:46.036745',NULL,NULL,'토','정기휴무 (매주 토요일)'),(82,'2024-05-22 16:02:46.037957',13,'2024-05-22 16:02:46.037963',NULL,NULL,'일','정기휴무 (매주 일요일)'),(83,'2024-05-22 16:02:46.039191',13,'2024-05-22 16:02:46.039196',NULL,NULL,'월','10:00 - 17:00'),(84,'2024-05-22 16:02:46.040428',13,'2024-05-22 16:02:46.040433',NULL,NULL,'화','10:00 - 17:00'),(85,'2024-05-22 16:02:46.041865',13,'2024-05-22 16:02:46.041870',NULL,NULL,'수','10:00 - 17:00'),(86,'2024-05-22 16:02:46.053374',14,'2024-05-22 16:02:46.053380',NULL,NULL,'목','09:00 - 18:00'),(87,'2024-05-22 16:02:46.054961',14,'2024-05-22 16:02:46.054966',NULL,NULL,'금','09:00 - 18:00'),(88,'2024-05-22 16:02:46.056098',14,'2024-05-22 16:02:46.056102',NULL,NULL,'토','10:00 - 17:00'),(89,'2024-05-22 16:02:46.057414',14,'2024-05-22 16:02:46.057421',NULL,NULL,'일','10:00 - 17:00'),(90,'2024-05-22 16:02:46.058923',14,'2024-05-22 16:02:46.058947',NULL,NULL,'월','09:00 - 18:00'),(91,'2024-05-22 16:02:46.060377',14,'2024-05-22 16:02:46.060381',NULL,NULL,'화','09:00 - 18:00'),(92,'2024-05-22 16:02:46.061824',14,'2024-05-22 16:02:46.061829',NULL,NULL,'수','09:00 - 18:00'),(93,'2024-05-22 16:02:46.072411',15,'2024-05-22 16:02:46.072416',NULL,NULL,'목','09:00 - 18:00'),(94,'2024-05-22 16:02:46.073517',15,'2024-05-22 16:02:46.073521',NULL,NULL,'금','09:00 - 18:00'),(95,'2024-05-22 16:02:46.074808',15,'2024-05-22 16:02:46.074813',NULL,NULL,'토','09:00 - 13:00'),(96,'2024-05-22 16:02:46.076148',15,'2024-05-22 16:02:46.076152',NULL,NULL,'일','정보없음'),(97,'2024-05-22 16:02:46.077118',15,'2024-05-22 16:02:46.077122',NULL,NULL,'월','09:00 - 18:00'),(98,'2024-05-22 16:02:46.078296',15,'2024-05-22 16:02:46.078300',NULL,NULL,'화','09:00 - 18:00'),(99,'2024-05-22 16:02:46.079759',15,'2024-05-22 16:02:46.079764',NULL,NULL,'수','09:00 - 18:00'),(100,'2024-05-22 16:02:46.090363',16,'2024-05-22 16:02:46.090368',NULL,NULL,'목','09:00 - 18:00'),(101,'2024-05-22 16:02:46.091701',16,'2024-05-22 16:02:46.091706',NULL,NULL,'금','09:00 - 18:00'),(102,'2024-05-22 16:02:46.094396',16,'2024-05-22 16:02:46.094402',NULL,NULL,'토','정기휴무 (매주 토요일)'),(103,'2024-05-22 16:02:46.095781',16,'2024-05-22 16:02:46.095785',NULL,NULL,'일','정기휴무 (매주 일요일)'),(104,'2024-05-22 16:02:46.097095',16,'2024-05-22 16:02:46.097098',NULL,NULL,'월','09:00 - 18:00'),(105,'2024-05-22 16:02:46.098413',16,'2024-05-22 16:02:46.098419',NULL,NULL,'화','09:00 - 18:00'),(106,'2024-05-22 16:02:46.100044',16,'2024-05-22 16:02:46.100049',NULL,NULL,'수','09:00 - 18:00'),(107,'2024-05-22 16:02:46.128161',18,'2024-05-22 16:02:46.128165',NULL,NULL,'매일','00:00 - 24:00'),(108,'2024-05-22 16:02:46.138690',19,'2024-05-22 16:02:46.138700',NULL,NULL,'목','09:00 - 18:00'),(109,'2024-05-22 16:02:46.140843',19,'2024-05-22 16:02:46.140849',NULL,NULL,'금','09:00 - 18:00'),(110,'2024-05-22 16:02:46.174981',19,'2024-05-22 16:02:46.174993',NULL,NULL,'토','10:00 - 18:00'),(111,'2024-05-22 16:02:46.178350',19,'2024-05-22 16:02:46.178366',NULL,NULL,'일','10:00 - 18:00'),(112,'2024-05-22 16:02:46.183802',19,'2024-05-22 16:02:46.183809',NULL,NULL,'월','09:00 - 18:00'),(113,'2024-05-22 16:02:46.187469',19,'2024-05-22 16:02:46.187475',NULL,NULL,'화','09:00 - 18:00'),(114,'2024-05-22 16:02:46.190038',19,'2024-05-22 16:02:46.190042',NULL,NULL,'수','09:00 - 18:00'),(115,'2024-05-22 16:02:46.203521',20,'2024-05-22 16:02:46.203527','12:30 - 13:30',NULL,'목','09:00 - 18:00'),(116,'2024-05-22 16:02:46.204708',20,'2024-05-22 16:02:46.204711','12:30 - 13:30',NULL,'금','09:00 - 18:00'),(117,'2024-05-22 16:02:46.206000',20,'2024-05-22 16:02:46.206003',NULL,NULL,'토','09:00 - 12:00'),(118,'2024-05-22 16:02:46.206962',20,'2024-05-22 16:02:46.206966',NULL,NULL,'일','정기휴무 (매주 일요일)'),(119,'2024-05-22 16:02:46.208266',20,'2024-05-22 16:02:46.208271','12:30 - 13:30',NULL,'월','09:00 - 18:00'),(120,'2024-05-22 16:02:46.209226',20,'2024-05-22 16:02:46.209229','12:30 - 13:30',NULL,'화','09:00 - 18:00'),(121,'2024-05-22 16:02:46.210133',20,'2024-05-22 16:02:46.210136','12:30 - 13:30',NULL,'수','09:00 - 18:00'),(122,'2024-05-22 16:02:46.220171',21,'2024-05-22 16:02:46.220174','12:00 - 13:00',NULL,'목','09:00 - 18:00'),(123,'2024-05-22 16:02:46.221403',21,'2024-05-22 16:02:46.221406','12:00 - 13:00',NULL,'금','09:00 - 18:00'),(124,'2024-05-22 16:02:46.222595',21,'2024-05-22 16:02:46.222598',NULL,NULL,'토','09:00 - 11:30'),(125,'2024-05-22 16:02:46.223685',21,'2024-05-22 16:02:46.223688',NULL,NULL,'일','정기휴무 (매주 일요일)'),(126,'2024-05-22 16:02:46.224780',21,'2024-05-22 16:02:46.224783','12:00 - 13:00',NULL,'월','09:00 - 18:00'),(127,'2024-05-22 16:02:46.226092',21,'2024-05-22 16:02:46.226095','12:00 - 13:00',NULL,'화','09:00 - 18:00'),(128,'2024-05-22 16:02:46.227407',21,'2024-05-22 16:02:46.227411','12:00 - 13:00',NULL,'수','09:00 - 18:00'),(129,'2024-05-22 16:02:46.245966',23,'2024-05-22 16:02:46.245969','12:00 - 13:00',NULL,'매일','10:00 - 15:00'),(130,'2024-05-22 16:02:46.255209',24,'2024-05-22 16:02:46.255212',NULL,NULL,'목','09:00 - 20:00'),(131,'2024-05-22 16:02:46.256486',24,'2024-05-22 16:02:46.256489',NULL,NULL,'금','09:00 - 20:00'),(132,'2024-05-22 16:02:46.257646',24,'2024-05-22 16:02:46.257649',NULL,NULL,'토','09:00 - 18:00'),(133,'2024-05-22 16:02:46.259993',24,'2024-05-22 16:02:46.259996',NULL,NULL,'일','정기휴무 (매주 일요일)'),(134,'2024-05-22 16:02:46.260920',24,'2024-05-22 16:02:46.260924',NULL,NULL,'월','09:00 - 20:00'),(135,'2024-05-22 16:02:46.261842',24,'2024-05-22 16:02:46.261845',NULL,NULL,'화','09:00 - 20:00'),(136,'2024-05-22 16:02:46.263048',24,'2024-05-22 16:02:46.263051',NULL,NULL,'수','09:00 - 20:00'),(137,'2024-05-22 16:02:46.272818',25,'2024-05-22 16:02:46.272823',NULL,NULL,'목','09:00 - 16:30'),(138,'2024-05-22 16:02:46.274106',25,'2024-05-22 16:02:46.274109',NULL,NULL,'금','09:00 - 16:30'),(139,'2024-05-22 16:02:46.275458',25,'2024-05-22 16:02:46.275461',NULL,NULL,'토','정기휴무 (매주 토요일)'),(140,'2024-05-22 16:02:46.276805',25,'2024-05-22 16:02:46.276808',NULL,NULL,'일','정기휴무 (매주 일요일)'),(141,'2024-05-22 16:02:46.277774',25,'2024-05-22 16:02:46.277777',NULL,NULL,'월','09:00 - 16:30'),(142,'2024-05-22 16:02:46.278725',25,'2024-05-22 16:02:46.278728',NULL,NULL,'화','09:00 - 16:30'),(143,'2024-05-22 16:02:46.279926',25,'2024-05-22 16:02:46.279929',NULL,NULL,'수','09:00 - 16:30'),(144,'2024-05-22 16:02:46.289598',26,'2024-05-22 16:02:46.289601',NULL,NULL,'목','09:00 - 18:00'),(145,'2024-05-22 16:02:46.290859',26,'2024-05-22 16:02:46.290862',NULL,NULL,'금','09:00 - 18:00'),(146,'2024-05-22 16:02:46.292062',26,'2024-05-22 16:02:46.292065',NULL,NULL,'토','정기휴무 (매주 토요일)'),(147,'2024-05-22 16:02:46.293305',26,'2024-05-22 16:02:46.293308',NULL,NULL,'일','정기휴무 (매주 일요일)'),(148,'2024-05-22 16:02:46.294362',26,'2024-05-22 16:02:46.294365',NULL,NULL,'월','09:00 - 18:00'),(149,'2024-05-22 16:02:46.295471',26,'2024-05-22 16:02:46.295474',NULL,NULL,'화','09:00 - 18:00'),(150,'2024-05-22 16:02:46.296690',26,'2024-05-22 16:02:46.296693',NULL,NULL,'수','09:00 - 18:00'),(151,'2024-05-22 16:02:46.307574',27,'2024-05-22 16:02:46.307577','12:30 - 13:30',NULL,'목','09:00 - 18:00'),(152,'2024-05-22 16:02:46.310369',27,'2024-05-22 16:02:46.310372','12:30 - 13:30',NULL,'금','09:00 - 18:00'),(153,'2024-05-22 16:02:46.311342',27,'2024-05-22 16:02:46.311345',NULL,NULL,'토','09:00 - 13:00'),(154,'2024-05-22 16:02:46.312615',27,'2024-05-22 16:02:46.312618',NULL,NULL,'일','정기휴무 (매주 일요일)'),(155,'2024-05-22 16:02:46.313877',27,'2024-05-22 16:02:46.313880','12:30 - 13:30',NULL,'월','09:00 - 18:00'),(156,'2024-05-22 16:02:46.315099',27,'2024-05-22 16:02:46.315102','12:30 - 13:30',NULL,'화','09:00 - 18:00'),(157,'2024-05-22 16:02:46.316302',27,'2024-05-22 16:02:46.316305','12:30 - 13:30',NULL,'수','09:00 - 18:00'),(158,'2024-05-22 16:02:46.327604',28,'2024-05-22 16:02:46.327607',NULL,NULL,'목','09:00 - 17:30'),(159,'2024-05-22 16:02:46.328908',28,'2024-05-22 16:02:46.328911',NULL,NULL,'금','09:00 - 17:30'),(160,'2024-05-22 16:02:46.330131',28,'2024-05-22 16:02:46.330134',NULL,NULL,'토','09:00 - 13:00'),(161,'2024-05-22 16:02:46.331335',28,'2024-05-22 16:02:46.331338',NULL,NULL,'일','정보없음'),(162,'2024-05-22 16:02:46.332597',28,'2024-05-22 16:02:46.332600',NULL,NULL,'월','09:00 - 17:30'),(163,'2024-05-22 16:02:46.333832',28,'2024-05-22 16:02:46.333837',NULL,NULL,'화','09:00 - 17:30'),(164,'2024-05-22 16:02:46.335124',28,'2024-05-22 16:02:46.335127',NULL,NULL,'수','09:00 - 17:30'),(165,'2024-05-22 16:02:46.345392',29,'2024-05-22 16:02:46.345393',NULL,NULL,'목','09:30 - 18:30'),(166,'2024-05-22 16:02:46.346640',29,'2024-05-22 16:02:46.346641',NULL,NULL,'금','09:30 - 18:30'),(167,'2024-05-22 16:02:46.347844',29,'2024-05-22 16:02:46.347845',NULL,NULL,'토','정기휴무 (매주 토요일)'),(168,'2024-05-22 16:02:46.348868',29,'2024-05-22 16:02:46.348869',NULL,NULL,'일','정기휴무 (매주 일요일)'),(169,'2024-05-22 16:02:46.350016',29,'2024-05-22 16:02:46.350017',NULL,NULL,'월','09:30 - 18:30'),(170,'2024-05-22 16:02:46.351105',29,'2024-05-22 16:02:46.351106',NULL,NULL,'화','09:30 - 18:30'),(171,'2024-05-22 16:02:46.352302',29,'2024-05-22 16:02:46.352303',NULL,NULL,'수','09:30 - 18:30'),(172,'2024-05-22 16:02:46.362553',30,'2024-05-22 16:02:46.362554',NULL,NULL,'목','10:00 - 17:00'),(173,'2024-05-22 16:02:46.363872',30,'2024-05-22 16:02:46.363874',NULL,NULL,'금','10:00 - 17:00'),(174,'2024-05-22 16:02:46.364833',30,'2024-05-22 16:02:46.364834',NULL,NULL,'토','정기휴무 (매주 토요일)'),(175,'2024-05-22 16:02:46.365754',30,'2024-05-22 16:02:46.365755',NULL,NULL,'일','정기휴무 (매주 일요일)'),(176,'2024-05-22 16:02:46.366623',30,'2024-05-22 16:02:46.366625',NULL,NULL,'월','10:00 - 17:00'),(177,'2024-05-22 16:02:46.367424',30,'2024-05-22 16:02:46.367425',NULL,NULL,'화','10:00 - 17:00'),(178,'2024-05-22 16:02:46.368315',30,'2024-05-22 16:02:46.368316',NULL,NULL,'수','10:00 - 17:00');
/*!40000 ALTER TABLE `clinic_hours` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `clinic_hours_seq`
--

DROP TABLE IF EXISTS `clinic_hours_seq`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `clinic_hours_seq` (
  `next_val` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `clinic_hours_seq`
--

LOCK TABLES `clinic_hours_seq` WRITE;
/*!40000 ALTER TABLE `clinic_hours_seq` DISABLE KEYS */;
INSERT INTO `clinic_hours_seq` VALUES (251);
/*!40000 ALTER TABLE `clinic_hours_seq` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `enroll`
--

DROP TABLE IF EXISTS `enroll`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `enroll` (
  `enroll_status` tinyint(4) DEFAULT NULL,
  `created_at` datetime(6) DEFAULT NULL,
  `enroll_id` bigint(20) NOT NULL,
  `hospital_id` bigint(20) DEFAULT NULL,
  `relation_id` bigint(20) DEFAULT NULL,
  `start_time` datetime(6) DEFAULT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  PRIMARY KEY (`enroll_id`),
  KEY `FKep0mkfc186r4fyv9gf3jkup1a` (`hospital_id`),
  KEY `FKcyp0wbt18d3y10kcbpkijivd1` (`relation_id`),
  CONSTRAINT `FKcyp0wbt18d3y10kcbpkijivd1` FOREIGN KEY (`relation_id`) REFERENCES `relation` (`relation_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `FKep0mkfc186r4fyv9gf3jkup1a` FOREIGN KEY (`hospital_id`) REFERENCES `hospital` (`hospital_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `enroll`
--

LOCK TABLES `enroll` WRITE;
/*!40000 ALTER TABLE `enroll` DISABLE KEYS */;
INSERT INTO `enroll` VALUES (0,'2024-06-01 12:05:49.076644',152,10,353,NULL,'2024-06-01 12:05:49.076875'),(0,'2024-06-01 12:06:12.747407',153,29,353,NULL,'2024-06-01 12:06:12.747418'),(0,'2024-06-01 12:06:22.030123',154,20,353,NULL,'2024-06-01 12:06:22.030128'),(0,'2024-06-01 15:00:33.766054',202,18,353,NULL,'2024-06-01 15:00:33.766087');
/*!40000 ALTER TABLE `enroll` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `enroll_seq`
--

DROP TABLE IF EXISTS `enroll_seq`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `enroll_seq` (
  `next_val` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `enroll_seq`
--

LOCK TABLES `enroll_seq` WRITE;
/*!40000 ALTER TABLE `enroll_seq` DISABLE KEYS */;
INSERT INTO `enroll_seq` VALUES (301);
/*!40000 ALTER TABLE `enroll_seq` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hospital`
--

DROP TABLE IF EXISTS `hospital`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hospital` (
  `created_at` datetime(6) DEFAULT NULL,
  `hospital_id` bigint(20) NOT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `category` varchar(255) DEFAULT NULL,
  `convenience` varchar(255) DEFAULT NULL,
  `doctors` varchar(255) DEFAULT NULL,
  `latitude` varchar(255) DEFAULT NULL,
  `longitude` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `parking` varchar(255) DEFAULT NULL,
  `subject` varchar(255) DEFAULT NULL,
  `tel` varchar(255) DEFAULT NULL,
  `website` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`hospital_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hospital`
--

LOCK TABLES `hospital` WRITE;
/*!40000 ALTER TABLE `hospital` DISABLE KEYS */;
INSERT INTO `hospital` VALUES ('2024-05-22 16:02:45.648911',1,'2024-05-22 16:02:45.648938','경기 고양시 일산서구 덕이로 212 백송프라자','요양병원','남/녀 화장실 구분|||장애인 휠체어 이용가능|||출입구 휠체어 이용가능|||좌석 휠체어 이용가능|||장애인 주차구역','가정의학과전문의 5명','37.6970240','126.7390830','무지개요양병원','주차불가','가정의학과|||한방내과','031-916-1122',NULL),('2024-05-22 16:02:45.703275',2,'2024-05-22 16:02:45.703296','경기 고양시 일산동구 장백로 174 지하1층~10층','요양병원','무선 인터넷|||남/녀 화장실 구분|||장애인 휠체어 이용가능|||출입구 휠체어 이용가능|||장애인 주차구역','가정의학과전문의 2명','37.6504751','126.7776368','연세나을요양병원','주차가능\n무료','가정의학과|||한방내과','0507-1336-4188',NULL),('2024-05-22 16:02:45.733337',3,'2024-05-22 16:02:45.733359','경기 고양시 일산동구 일산로 439','요양병원','남/녀 화장실 구분|||장애인 주차구역','산부인과전문의 2명, 영상의학과전문의 1명','37.6729980','126.7780076','동원요양병원','주차가능','산부인과|||영상의학과|||가정의학과|||내과|||한방내과','0507-1494-7006',NULL),('2024-05-22 16:02:45.775017',4,'2024-05-22 16:02:45.775027','경기 고양시 일산동구 중앙로 1312','요양병원','남/녀 화장실 구분|||단체 이용 가능|||예약|||무선 인터넷|||장애인 주차구역','산부인과전문의 1명','37.6630287','126.7710812','차연요양병원','주차가능','산부인과|||한방내과','0507-1377-1058',NULL),('2024-05-22 16:02:45.817055',5,'2024-05-22 16:02:45.817070','경기 고양시 일산서구 주화로 88 효림빌딩','요양병원','남/녀 화장실 구분|||무선 인터넷|||장애인 주차구역','가정의학과전문의 2명','37.6704860','126.7584407','효림요양병원','주차가능\n무료','가정의학과|||내과|||사상체질과|||신경과|||외과|||재활의학과|||침구과|||피부과|||한방내과|||한방신경정신과|||한방재활의학과','031-919-0041',NULL),('2024-05-22 16:02:45.851957',6,'2024-05-22 16:02:45.851964','경기 고양시 일산동구 장백로 86 한경프라자 3층~7층','요양병원','무선 인터넷|||예약|||방문접수/출장|||남/녀 화장실 구분|||장애인 주차구역','내과전문의 2명, 재활의학과전문의 1명','37.6447214','126.7844063','일산사랑요양병원','주차가능','내과|||재활의학과|||소아청소년과|||신경외과|||외과|||이비인후과|||정형외과|||한방내과','0507-1315-8120',NULL),('2024-05-22 16:02:45.875968',7,'2024-05-22 16:02:45.875974','경기 고양시 일산동구 무궁화로 346 지하1~2층,1~3층','요양병원','무선 인터넷|||남/녀 화장실 구분|||장애인 주차구역','내과전문의 2명, 재활의학과전문의 1명','37.6766556','126.7981216','일산현대요양병원','주차가능','내과|||재활의학과|||가정의학과|||병리과|||비뇨의학과|||소아청소년과|||신경과|||영상의학과|||이비인후과|||피부과|||한방내과','031-922-7575',NULL),('2024-05-22 16:02:45.898674',8,'2024-05-22 16:02:45.898681','경기 고양시 일산동구 성현로29번길 28-9','요양병원',NULL,NULL,'37.7119940','126.7912256','다스람요양병원',NULL,NULL,'1800-5173',NULL),('2024-05-22 16:02:45.928451',9,'2024-05-22 16:02:45.928457','경기 고양시 일산서구 일중로 59 일산마샬빌딩','요양병원',NULL,'내과전문의 1명','37.6849626','126.7752334','로하스일산요양병원',NULL,'내과|||가정의학과|||재활의학과|||한방내과','031-976-2200',NULL),('2024-05-22 16:02:45.953267',10,'2024-05-22 16:02:45.953279','경기 고양시 덕양구 향동로 123 전관','요양병원','예약|||장애인 휠체어 이용가능|||출입구 휠체어 이용가능|||좌석 휠체어 이용가능|||장애인 주차구역',NULL,'37.6008956','126.8892014','향동포레요양병원','주차가능\n무료',NULL,'02-3158-3335',NULL),('2024-05-22 16:02:45.982735',11,'2024-05-22 16:02:45.982743','경기 고양시 덕양구 토당로67번길 2','요양병원','무선 인터넷|||남/녀 화장실 구분|||장애인 주차구역',NULL,'37.6215250','126.8184670','새찬요양병원','주차가능',NULL,'031-979-2119',NULL),('2024-05-22 16:02:46.004296',12,'2024-05-22 16:02:46.004306','경기 고양시 일산동구 고봉로 20-21 양우로데오랜드 B동 3F~5F','요양병원',NULL,'정형외과전문의 2명, 내과전문의 1명','37.6636899','126.7655568','자애요양병원','주차가능\n무료','정형외과|||내과|||가정의학과|||신경외과|||외과|||재활의학과|||한방내과','031-919-9942',NULL),('2024-05-22 16:02:46.031357',13,'2024-05-22 16:02:46.031364','경기 고양시 일산동구 중앙로 1124 흰돌마을상가 4층','요양병원','예약|||남/녀 화장실 구분|||무선 인터넷|||장애인 주차구역','가정의학과전문의 1명, 내과전문의 1명 외 전문의 1명','37.6483477','126.7816726','이푸른요양병원','주차가능','가정의학과|||내과|||재활의학과|||신경과|||신경외과|||외과|||정형외과|||침구과','0507-1443-3340',NULL),('2024-05-22 16:02:46.051307',14,'2024-05-22 16:02:46.051312','경기 고양시 일산동구 하늘마을1로 14 일산 조은프라자','요양병원','남/녀 화장실 구분','가정의학과전문의 1명, 재활의학과전문의 1명','37.6749414','126.7869830','일산아르고요양병원','주차가능','가정의학과|||재활의학과|||내과|||신경과|||한방내과','0507-1359-1844',NULL),('2024-05-22 16:02:46.070794',15,'2024-05-22 16:02:46.070799','경기 고양시 덕양구 중앙로 620','요양병원','남/녀 화장실 구분|||예약|||장애인 주차구역','가정의학과전문의 1명, 재활의학과전문의 1명','37.6271987','126.8299415','고양센트럴요양병원','주차가능','가정의학과|||재활의학과|||한방내과|||내과|||사상체질과|||신경과|||신경외과|||심장혈관흉부외과|||외과|||응급의학과|||정형외과|||침구과|||피부과|||한방부인과|||한방소아과|||한방신경정신과|||한방안·이비인후·피부과|||한방재활의학과','0507-1399-7809',NULL),('2024-05-22 16:02:46.088648',16,'2024-05-22 16:02:46.088652','경기 고양시 덕양구 호국로 804 원당타운','요양병원','예약','가정의학과전문의 1명, 재활의학과전문의 1명','37.6574779','126.8375919','로하스클로버요양병원','주차가능','가정의학과|||재활의학과|||내과|||비뇨의학과|||영상의학과|||예방의학과|||외과|||이비인후과|||정신건강의학과|||정형외과|||침구과|||피부과|||한방내과|||한방재활의학과','031-967-5050',NULL),('2024-05-22 16:02:46.117148',17,'2024-05-22 16:02:46.117153','경기 고양시 일산서구 중앙로 1564 그린월드','요양병원','남/녀 화장실 구분',NULL,'37.6760623','126.7483261','일산메디안요양병원','주차가능','가정의학과|||내과|||신경과|||재활의학과|||비뇨의학과|||소아청소년과|||신경외과|||외과|||이비인후과|||정형외과|||피부과|||한방내과','031-913-3119',NULL),('2024-05-22 16:02:46.126309',18,'2024-05-22 16:02:46.126314','경기 고양시 일산동구 무궁화로 31-16 남정시티프라자 8차','요양병원','남/녀 화장실 구분',NULL,'37.6635029','126.7677200','일산참사랑요양병원','주차가능','한방재활의학과|||가정의학과|||내과|||비뇨의학과|||신경과|||이비인후과|||재활의학과|||피부과','031-918-1070',NULL),('2024-05-22 16:02:46.136812',19,'2024-05-22 16:02:46.136818','경기 고양시 일산동구 성현로377번길 128-4','요양병원','단체 이용 가능|||무선 인터넷|||유아시설 (놀이방)|||남/녀 화장실 구분|||장애인 주차구역','가정의학과전문의 1명, 심장혈관흉부외과전문의 1명','37.7004067','126.8332467','정안요양병원','주차가능\n무료','가정의학과|||심장혈관흉부외과|||내과|||사상체질과|||신경과|||정형외과|||침구과|||한방내과','031-977-8757',NULL),('2024-05-22 16:02:46.201933',20,'2024-05-22 16:02:46.201938','경기 고양시 덕양구 중앙로557번길 7-14 원스톱라이프상가','요양병원','예약|||방문접수/출장','산부인과전문의 2명, 내과전문의 1명 외 전문의 2명','37.6227551','126.8353994','강북성심요양병원','주차가능','산부인과|||내과|||신경과|||재활의학과|||가정의학과|||비뇨의학과|||소아청소년과|||이비인후과|||침구과|||피부과','031-978-1122',NULL),('2024-05-22 16:02:46.218480',21,'2024-05-22 16:02:46.218484','경기 고양시 일산동구 백마로 490','요양병원','남/녀 화장실 구분|||무선 인터넷|||예약|||대기공간|||장애인 휠체어 이용가능|||출입구 휠체어 이용가능|||장애인 주차구역',NULL,'37.6617556','126.8032749','자향요양병원','주차가능\n무료','마취통증의학과|||방사선종양학과|||외과|||한방내과','1661-8927',NULL),('2024-05-22 16:02:46.235868',22,'2024-05-22 16:02:46.235873','경기 고양시 일산동구 위시티로 18 동국타워','요양병원','남/녀 화장실 구분',NULL,'37.6745785','126.8075370','일산리더스요양병원','주차가능','가정의학과|||내과|||침구과|||한방내과','031-962-0050',NULL),('2024-05-22 16:02:46.244524',23,'2024-05-22 16:02:46.244529','경기 고양시 덕양구 내유길 146-19','요양병원','예약',NULL,'37.7231257','126.8645475','의료법인에덴재단행복한요양병원','주차가능','내과|||신경과|||재활의학과|||침구과|||한방내과|||한방재활의학과','031-963-5600',NULL),('2024-05-22 16:02:46.253867',24,'2024-05-22 16:02:46.253872','경기 고양시 일산동구 고봉로 467-57 가동 지하1층~지상3층','요양병원',NULL,'방사선종양학과전문의 1명','37.7004559','126.7789872','다나은요양병원','주차가능\n무료','방사선종양학과|||한방내과|||내과|||신경과|||신경외과|||외과|||재활의학과|||정형외과','0507-1458-1360',NULL),('2024-05-22 16:02:46.271374',25,'2024-05-22 16:02:46.271378','경기 고양시 일산서구 고봉로 291 에이스스타디움','요양병원','남/녀 화장실 구분','외과전문의 2명','37.6851029','126.7772182','일산한울요양병원','주차가능','외과|||내과|||재활의학과|||침구과','031-975-3700',NULL),('2024-05-22 16:02:46.287998',26,'2024-05-22 16:02:46.288001','경기 고양시 일산동구 숲속마을로 18 웰빙타운','요양병원','예약|||방문접수/출장|||무선 인터넷|||남/녀 화장실 구분|||장애인 주차구역','가정의학과전문의 2명, 재활의학과전문의 1명','37.6672206','126.8013215','동국마음요양병원','주차가능','가정의학과|||재활의학과|||한방재활의학과|||내과|||외과','031-811-9900',NULL),('2024-05-22 16:02:46.306066',27,'2024-05-22 16:02:46.306070','경기 고양시 일산서구 일현로 53 메디누리','요양병원','남/녀 화장실 구분','신경외과전문의 1명, 외과전문의 1명','37.6920181','126.7630329','메디누리요양병원','주차가능','신경외과|||외과|||가정의학과|||내과|||비뇨의학과|||재활의학과|||정형외과|||침구과|||피부과|||한방내과|||한방부인과|||한방신경정신과|||한방안·이비인후·피부과|||한방재활의학과','031-925-7575',NULL),('2024-05-22 16:02:46.325967',28,'2024-05-22 16:02:46.325970','경기 고양시 덕양구 지도로 100','요양병원',NULL,NULL,'37.6261199','126.8240908','삼성요양병원','주차가능','내과|||비뇨의학과|||신경과|||이비인후과|||재활의학과|||침구과|||피부과|||한방내과|||한방부인과','031-972-5678',NULL),('2024-05-22 16:02:46.344097',29,'2024-05-22 16:02:46.344137','경기 고양시 덕양구 중앙로 478 행신미원프라자','요양병원',NULL,'가정의학과전문의 2명, 내과전문의 1명','37.6194397','126.8426343','효그린요양병원',NULL,'가정의학과|||내과|||비뇨의학과|||사상체질과|||소아청소년과|||신경과|||외과|||이비인후과|||재활의학과|||정신건강의학과|||침구과|||피부과|||한방내과|||한방소아과|||한방재활의학과','031-979-0808',NULL),('2024-05-22 16:02:46.360987',30,'2024-05-22 16:02:46.360989','경기 고양시 일산동구 호수로 646-24 위너스21-II','요양병원','남/녀 화장실 구분',NULL,'37.6596790','126.7680799','일산호수요양병원','주차가능','내과|||소아청소년과|||신경과|||신경외과|||재활의학과|||정형외과|||침구과|||한방내과','031-903-8275',NULL);
/*!40000 ALTER TABLE `hospital` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hospital_seq`
--

DROP TABLE IF EXISTS `hospital_seq`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hospital_seq` (
  `next_val` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hospital_seq`
--

LOCK TABLES `hospital_seq` WRITE;
/*!40000 ALTER TABLE `hospital_seq` DISABLE KEYS */;
INSERT INTO `hospital_seq` VALUES (101);
/*!40000 ALTER TABLE `hospital_seq` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `member`
--

DROP TABLE IF EXISTS `member`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `member` (
  `created_at` datetime(6) DEFAULT NULL,
  `member_id` bigint(20) NOT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `role` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `username` varchar(255) DEFAULT NULL,
  `latitude` varchar(255) DEFAULT NULL,
  `longitude` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`member_id`),
  UNIQUE KEY `UK_mbmcqelty0fbrvxp1q58dn57t` (`email`),
  UNIQUE KEY `UK_6ithqvsvrcawbi9dtxu0ttsny` (`phone`),
  UNIQUE KEY `UK_gc3jmn7c2abyo3wf6syln5t2i` (`username`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `member`
--

LOCK TABLES `member` WRITE;
/*!40000 ALTER TABLE `member` DISABLE KEYS */;
INSERT INTO `member` VALUES ('2024-05-31 14:19:12.320605',152,'2024-05-31 14:19:12.320646',NULL,NULL,'박의',NULL,NULL,NULL,'kakao','kakao_3419236905',NULL,NULL),('2024-05-31 14:19:27.639871',153,'2024-05-31 14:19:27.639953',NULL,'wkwk2805u@naver.com','박의',NULL,NULL,NULL,'naver','naver_njxCNyK7eUlkNB',NULL,NULL);
/*!40000 ALTER TABLE `member` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `member_seq`
--

DROP TABLE IF EXISTS `member_seq`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `member_seq` (
  `next_val` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `member_seq`
--

LOCK TABLES `member_seq` WRITE;
/*!40000 ALTER TABLE `member_seq` DISABLE KEYS */;
INSERT INTO `member_seq` VALUES (251);
/*!40000 ALTER TABLE `member_seq` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `patient`
--

DROP TABLE IF EXISTS `patient`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `patient` (
  `created_at` datetime(6) DEFAULT NULL,
  `patient_id` bigint(20) NOT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `grade` int(1) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `latitude` varchar(255) DEFAULT NULL,
  `longitude` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`patient_id`),
  UNIQUE KEY `UK_9gxe97j2ngjjvtkig6b6jvy91` (`phone`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `patient`
--

LOCK TABLES `patient` WRITE;
/*!40000 ALTER TABLE `patient` DISABLE KEYS */;
INSERT INTO `patient` VALUES ('2024-06-01 11:12:15.513430',353,'2024-06-01 11:12:15.513442','경기 고양시 덕양구 향기5로 65 402동 1808호',2,'박의','01012341234','126.895470695773','37.6079396224853');
/*!40000 ALTER TABLE `patient` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `patient_seq`
--

DROP TABLE IF EXISTS `patient_seq`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `patient_seq` (
  `next_val` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `patient_seq`
--

LOCK TABLES `patient_seq` WRITE;
/*!40000 ALTER TABLE `patient_seq` DISABLE KEYS */;
INSERT INTO `patient_seq` VALUES (451);
/*!40000 ALTER TABLE `patient_seq` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `relation`
--

DROP TABLE IF EXISTS `relation`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `relation` (
  `created_at` datetime(6) DEFAULT NULL,
  `member_id` bigint(20) DEFAULT NULL,
  `patient_id` bigint(20) DEFAULT NULL,
  `relation_id` bigint(20) NOT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  PRIMARY KEY (`relation_id`),
  UNIQUE KEY `UKftlu0lgfowee6gqhvqkbynqkm` (`member_id`,`patient_id`),
  KEY `FKeo1qrcriftb7gphcyfmn1p3vm` (`patient_id`),
  CONSTRAINT `FKeo1qrcriftb7gphcyfmn1p3vm` FOREIGN KEY (`patient_id`) REFERENCES `patient` (`patient_id`) ON DELETE CASCADE,
  CONSTRAINT `FKp24mb4xg52q79wh8744ca90a3` FOREIGN KEY (`member_id`) REFERENCES `member` (`member_id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `relation`
--

LOCK TABLES `relation` WRITE;
/*!40000 ALTER TABLE `relation` DISABLE KEYS */;
INSERT INTO `relation` VALUES (NULL,153,353,353,'2024-06-01 11:12:15.518032');
/*!40000 ALTER TABLE `relation` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `relation_seq`
--

DROP TABLE IF EXISTS `relation_seq`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `relation_seq` (
  `next_val` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `relation_seq`
--

LOCK TABLES `relation_seq` WRITE;
/*!40000 ALTER TABLE `relation_seq` DISABLE KEYS */;
INSERT INTO `relation_seq` VALUES (451);
/*!40000 ALTER TABLE `relation_seq` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-06-01 16:30:31
